# Exercise 4.6

# 01. Importing libraries

In [4]:
# import libraries
import pandas as pd
import numpy as np
import os

# 02. Import Data

In [7]:
# create path
path = r'C:\Users\kthav\My Pc\Desktop\Career Foundry\Data Immersion\Python Fundamentals for Data Analytics\11-12-2024 Instacart Basket Analysis'

In [11]:
# import orders_checked.csv as df_ords
df_ords =pd.read_csv(os.path.join(path, 'Data', 'Prepared Data', 'orders_checked.csv'), index_col = False)

In [18]:
# import orders_products_prior.csv as df_ords_prior
df_ords_prior = pd.read_csv(os.path.join(path, 'Data', 'Prepared Data', 'orders_products_prior.csv'), index_col = False)

In [22]:
#check output
df_ords_prior.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [26]:
# check output
df_ords.head()

,Unnamed: 0.1,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order,first_order
0,0,0,2539329,1,1,2,8,NaN,True
1,1,1,2398795,1,2,3,7,15.0,False
2,2,2,473747,1,3,3,12,21.0,False
3,3,3,2254736,1,4,4,7,29.0,False
4,4,4,431534,1,5,4,15,28.0,False

In [28]:
df_ords_prior.shape

(32434489, 4)

In [32]:
df_ords.shape

(3404816, 9)

# 03. Merge Data

In [42]:
# merge df_ords and df_ords_prior as df_merged_large
df_merged_large = df_ords.merge(df_ords_prior, on = 'order_id', indicator = True)

In [53]:
# check output
df_merged_large.head()

,Unnamed: 0.1,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order,first_order,product_id,add_to_cart_order,reordered,_merge
0,0,0,2539329,1,1,2,8,NaN,True,196,1,0,both
1,0,0,2539329,1,1,2,8,NaN,True,14084,2,0,both
2,0,0,2539329,1,1,2,8,NaN,True,12427,3,0,both
3,0,0,2539329,1,1,2,8,NaN,True,26088,4,0,both
4,0,0,2539329,1,1,2,8,NaN,True,26405,5,0,both

In [55]:
# check shape
df_merged_large.shape

(32281329, 13)

In [48]:
# check merge frequency
df_merged_large['_merge'].value_counts()

_merge
both          32281329
left_only            0
right_only           0
Name: count, dtype: int64

# 04. Export Data

In [51]:
# export df_merged_large as orders_products_combined.pkl
df_merged_large.to_pickle(os.path.join(path, 'Data', 'Prepared Data', 'orders_products_combined.pkl'))